// cложение и присваивание
let a = 10;
a += 5; // эквивалентно a = a + 5;
console.log(a); // Выводит 15

// вычитание и присваивание
let b = 10;
b -= 5; // Это эквивалентно b = b - 5;
console.log(b); // 5

// умножение и присваивание
let c = 10;
c *= 5; // Это эквивалентно c = c * 5;
console.log(c); // 50

// деление и присваивание
let d = 10;
d /= 5; // Это эквивалентно d = d / 5;
console.log(d); // 2

// Остаток от деления и присваивание
let e = 10;
e %= 4; // Это эквивалентно e = e % 4;
console.log(e); // 2